{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2023-05-27T21:54:47.736686600Z",
     "start_time": "2023-05-27T21:54:46.698080700Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": "<IPython.core.display.HTML object>",
      "text/html": "<span class=\"tex2jax_ignore\"><svg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" xml:lang=\"en\" id=\"93a7b80fb03c4ba282168be3f63de7bd-0\" class=\"displacy\" width=\"925\" height=\"224.5\" direction=\"ltr\" style=\"max-width: none; height: 224.5px; color: #000000; background: #ffffff; font-family: Arial; direction: ltr\">\n<text class=\"displacy-token\" fill=\"currentColor\" text-anchor=\"middle\" y=\"134.5\">\n    <tspan class=\"displacy-word\" fill=\"currentColor\" x=\"50\">Marie Curie</tspan>\n    <tspan class=\"displacy-tag\" dy=\"2em\" fill=\"currentColor\" x=\"50\">PROPN</tspan>\n</text>\n\n<text class=\"displacy-token\" fill=\"currentColor\" text-anchor=\"middle\" y=\"134.5\">\n    <tspan class=\"displacy-word\" fill=\"currentColor\" x=\"225\">received</tspan>\n    <tspan class=\"displacy-tag\" dy=\"2em\" fill=\"currentColor\" x=\"225\">VERB</tspan>\n</text>\n\n<text class=\"displacy-token\" fill=\"currentColor\" text-anchor=\"middle\" y=\"134.5\">\n    <tspan class=\"displacy-word\" fill=\"currentColor\" x=\"400\">the Nobel Prize</tspan>\n    <tspan class=\"displacy-tag\" dy=\"2em\" fill=\"currentColor\" x=\"400\">PROPN</tspan>\n</text>\n\n<text class=\"displacy-token\" fill=\"currentColor\" text-anchor=\"middle\" y=\"134.5\">\n    <tspan class=\"displacy-word\" fill=\"currentColor\" x=\"575\">in</tspan>\n    <tspan class=\"displacy-tag\" dy=\"2em\" fill=\"currentColor\" x=\"575\">ADP</tspan>\n</text>\n\n<text class=\"displacy-token\" fill=\"currentColor\" text-anchor=\"middle\" y=\"134.5\">\n    <tspan class=\"displacy-word\" fill=\"currentColor\" x=\"750\">Physics</tspan>\n    <tspan class=\"displacy-tag\" dy=\"2em\" fill=\"currentColor\" x=\"750\">PROPN</tspan>\n</text>\n\n<g class=\"displacy-arrow\">\n    <path class=\"displacy-arc\" id=\"arrow-93a7b80fb03c4ba282168be3f63de7bd-0-0\" stroke-width=\"2px\" d=\"M70,89.5 C70,2.0 225.0,2.0 225.0,89.5\" fill=\"none\" stroke=\"currentColor\"/>\n    <text dy=\"1.25em\" style=\"font-size: 0.8em; letter-spacing: 1px\">\n        <textPath xlink:href=\"#arrow-93a7b80fb03c4ba282168be3f63de7bd-0-0\" class=\"displacy-label\" startOffset=\"50%\" side=\"left\" fill=\"currentColor\" text-anchor=\"middle\">nsubj</textPath>\n    </text>\n    <path class=\"displacy-arrowhead\" d=\"M70,91.5 L62,79.5 78,79.5\" fill=\"currentColor\"/>\n</g>\n\n<g class=\"displacy-arrow\">\n    <path class=\"displacy-arc\" id=\"arrow-93a7b80fb03c4ba282168be3f63de7bd-0-1\" stroke-width=\"2px\" d=\"M245,89.5 C245,2.0 400.0,2.0 400.0,89.5\" fill=\"none\" stroke=\"currentColor\"/>\n    <text dy=\"1.25em\" style=\"font-size: 0.8em; letter-spacing: 1px\">\n        <textPath xlink:href=\"#arrow-93a7b80fb03c4ba282168be3f63de7bd-0-1\" class=\"displacy-label\" startOffset=\"50%\" side=\"left\" fill=\"currentColor\" text-anchor=\"middle\">dobj</textPath>\n    </text>\n    <path class=\"displacy-arrowhead\" d=\"M400.0,91.5 L408.0,79.5 392.0,79.5\" fill=\"currentColor\"/>\n</g>\n\n<g class=\"displacy-arrow\">\n    <path class=\"displacy-arc\" id=\"arrow-93a7b80fb03c4ba282168be3f63de7bd-0-2\" stroke-width=\"2px\" d=\"M420,89.5 C420,2.0 575.0,2.0 575.0,89.5\" fill=\"none\" stroke=\"currentColor\"/>\n    <text dy=\"1.25em\" style=\"font-size: 0.8em; letter-spacing: 1px\">\n        <textPath xlink:href=\"#arrow-93a7b80fb03c4ba282168be3f63de7bd-0-2\" class=\"displacy-label\" startOffset=\"50%\" side=\"left\" fill=\"currentColor\" text-anchor=\"middle\">prep</textPath>\n    </text>\n    <path class=\"displacy-arrowhead\" d=\"M575.0,91.5 L583.0,79.5 567.0,79.5\" fill=\"currentColor\"/>\n</g>\n\n<g class=\"displacy-arrow\">\n    <path class=\"displacy-arc\" id=\"arrow-93a7b80fb03c4ba282168be3f63de7bd-0-3\" stroke-width=\"2px\" d=\"M595,89.5 C595,2.0 750.0,2.0 750.0,89.5\" fill=\"none\" stroke=\"currentColor\"/>\n    <text dy=\"1.25em\" style=\"font-size: 0.8em; letter-spacing: 1px\">\n        <textPath xlink:href=\"#arrow-93a7b80fb03c4ba282168be3f63de7bd-0-3\" class=\"displacy-label\" startOffset=\"50%\" side=\"left\" fill=\"currentColor\" text-anchor=\"middle\">pobj</textPath>\n    </text>\n    <path class=\"displacy-arrowhead\" d=\"M750.0,91.5 L758.0,79.5 742.0,79.5\" fill=\"currentColor\"/>\n</g>\n</svg></span>"
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import spacy\n",
    "\n",
    "nlp = spacy.load(\"en_core_web_sm\")\n",
    "doc = nlp(\"Marie Curie received the Nobel Prize in Physics\")\n",
    "options = {\"collapse_phrases\": True}\n",
    "\n",
    "# we can display\n",
    "spacy.displacy.render(doc, style=\"dep\", options=options, jupyter=True)\n",
    "\"\"\"\n",
    "(verb: receive, subject: p:Person, object: a:Prize) → (relationship: RECEIVE_PRIZE, from: p, to:a)\n",
    "\n",
    "Here, “receive” (considered in the lemmatized version) is an English verb, whereas RECEIVE_PRIZE is a relationship type\n",
    "(a semantic relation).\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "from py2neo import Graph\n",
    "\n",
    "# Connect to database\n",
    "url = \"bolt://localhost:7687\"\n",
    "username = os.getenv(\"NEO4J_USER\")\n",
    "password = os.getenv(\"NEO4J_PASSWORD_\")\n",
    "database = \"spacy-ner\"\n",
    "\n",
    "graph = Graph(url, auth=(username, password), name=database)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (verb:TagOccurrence {pos: \"VBD\", lemma:\"receive\"})\n",
    "WITH verb\n",
    "MATCH p=(verb)-[:IS_DEPENDENT {type:\"nsubj\"}]->(subject)-[:PARTICIPATES_IN]-> (person:NamedEntity {type: \"PERSON\"})\n",
    "MATCH q=(verb)-[:IS_DEPENDENT {type:\"dobj\"}]->(object)-[:PARTICIPATES_IN]-> (woa:NamedEntity {type: \"WORK_OF_ART\"})\n",
    "RETURN verb, person, woa, p, q\n",
    "\"\"\"\n",
    "\n",
    "sentence = \"Marie Curie received the Nobel Prize in Physics in 1903.\"\n",
    "\"\"\"\n",
    " But “receive” conveys many relations, and we don’t want instances of “receive”\n",
    " involving other types of arguments to be translated into the RECEIVE_PRIZE relationship\n",
    "\n",
    " “The Committee awarded the prize to Marie Curie.”\n",
    " “The prize was awarded to Marie Curie.”\n",
    "\n",
    " (relationship: \"win\", subject: p:Person, object: a:Prize) ®\n",
    "  (relationship: RECEIVE_PRIZE, from: p, to:a)\n",
    " (relationship: \"award\", indirect-object: p:Person, object: a:Prize) ®\n",
    "  (relationship: RECEIVE_PRIZE, from: p, to:a)\n",
    "\"\"\"\n",
    "res = graph.run(query).to_data_frame()\n",
    "res"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (nodelPrize:Entity {type:\"WORK_OF_ART\"})<-[:TO]-(rel:Relationship {type: \"RECEIVE_PRIZE\"})-[:FROM]->(winner:Entity {type: \"PERSON\"})\n",
    "WHERE nodelPrize.id CONTAINS \"the Nobel Prize in Physics\"\n",
    "RETURN winner\n",
    "\"\"\"\n",
    "res = graph.run(query).to_data_frame()\n",
    "res"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "## ConceptNet"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Synonym: Marya Sklodowska\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "obj = requests.get(\"http://api.conceptnet.io/c/en/marie_curie\").json()\n",
    "print(obj['edges'][0]['rel']['label'] + \": \" + obj['edges'][0]['end']['label'])"
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2023-05-28T00:36:18.504600200Z",
     "start_time": "2023-05-28T00:36:17.824466Z"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'@context': ['http://api.conceptnet.io/ld/conceptnet5.7/context.ld.json'],\n",
      " '@id': '/c/en/blueprint',\n",
      " 'edges': [{'@id': '/a/[/r/Synonym/,/c/pt/planta/n/wn/artifact/,/c/en/blueprint/n/wn/artifact/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/artifact',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, artifact',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/pt/planta/n/wn/artifact',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'Planta',\n",
      "                      'language': 'pt',\n",
      "                      'sense_label': 'n, artifact',\n",
      "                      'term': '/c/pt/planta'},\n",
      "            'surfaceText': '[[Planta]] is a translation of [[blueprint]]',\n",
      "            'weight': 3.4641016151377544},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/pt/projeto/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/pt/projeto/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'projeto',\n",
      "                      'language': 'pt',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/pt/projeto'},\n",
      "            'surfaceText': '[[projeto]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/es/hacer_un_borrador/v/wn/creation/,/c/en/blueprint/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/es/hacer_un_borrador/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'hacer un borrador',\n",
      "                      'language': 'es',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/es/hacer_un_borrador'},\n",
      "            'surfaceText': '[[hacer un borrador]] is a translation of '\n",
      "                           '[[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/id/pola/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/id/pola/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'pola',\n",
      "                      'language': 'id',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/id/pola'},\n",
      "            'surfaceText': '[[pola]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/id/corak/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/id/corak/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'corak',\n",
      "                      'language': 'id',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/id/corak'},\n",
      "            'surfaceText': '[[corak]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/fi/sinikopio/n/wn/artifact/,/c/en/blueprint/n/wn/artifact/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/artifact',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, artifact',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/fi/sinikopio/n/wn/artifact',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'sinikopio',\n",
      "                      'language': 'fi',\n",
      "                      'sense_label': 'n, artifact',\n",
      "                      'term': '/c/fi/sinikopio'},\n",
      "            'surfaceText': '[[sinikopio]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/ms/lakaran/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/ms/lakaran/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'lakaran',\n",
      "                      'language': 'ms',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/ms/lakaran'},\n",
      "            'surfaceText': '[[lakaran]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/es/diseño/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/es/diseño/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'diseño',\n",
      "                      'language': 'es',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/es/diseño'},\n",
      "            'surfaceText': '[[diseño]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/id/mewamilkan/v/wn/creation/,/c/en/blueprint/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/id/mewamilkan/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'mewamilkan',\n",
      "                      'language': 'id',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/id/mewamilkan'},\n",
      "            'surfaceText': '[[mewamilkan]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/fr/rédiger/v/wn/creation/,/c/en/blueprint/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/fr/rédiger/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'rédiger',\n",
      "                      'language': 'fr',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/fr/rédiger'},\n",
      "            'surfaceText': '[[rédiger]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/MannerOf/,/c/en/blueprint/v/wn/creation/,/c/en/design/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/design/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'design',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/design'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/MannerOf',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'MannerOf'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'blueprint',\n",
      "                      'language': 'en',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/en/blueprint'},\n",
      "            'surfaceText': '[[blueprint]] is a way to [[design]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/pt/esquema/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/pt/esquema/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'esquema',\n",
      "                      'language': 'pt',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/pt/esquema'},\n",
      "            'surfaceText': '[[esquema]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/fr/élaborer/v/wn/creation/,/c/en/blueprint/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/fr/élaborer/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'élaborer',\n",
      "                      'language': 'fr',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/fr/élaborer'},\n",
      "            'surfaceText': '[[élaborer]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/ja/青図/n/,/c/en/blueprint/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/jmdict',\n",
      "            'end': {'@id': '/c/en/blueprint',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by-sa/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/jmdict/1.07',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/jmdict/1.07'}],\n",
      "            'start': {'@id': '/c/ja/青図/n',\n",
      "                      '@type': 'Node',\n",
      "                      'label': '青図',\n",
      "                      'language': 'ja',\n",
      "                      'sense_label': 'n',\n",
      "                      'term': '/c/ja/青図'},\n",
      "            'surfaceText': None,\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/fr/modèle/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/fr/modèle/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'modèle',\n",
      "                      'language': 'fr',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/fr/modèle'},\n",
      "            'surfaceText': '[[modèle]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/id/merencanakan/v/wn/creation/,/c/en/blueprint/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/id/merencanakan/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'merencanakan',\n",
      "                      'language': 'id',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/id/merencanakan'},\n",
      "            'surfaceText': '[[merencanakan]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/ca/cianografia/n/wn/artifact/,/c/en/blueprint/n/wn/artifact/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/artifact',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, artifact',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/ca/cianografia/n/wn/artifact',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'cianografia',\n",
      "                      'language': 'ca',\n",
      "                      'sense_label': 'n, artifact',\n",
      "                      'term': '/c/ca/cianografia'},\n",
      "            'surfaceText': '[[cianografia]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/id/rekabentuk/n/wn/cognition/,/c/en/blueprint/n/wn/cognition/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/cognition',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, cognition',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/id/rekabentuk/n/wn/cognition',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'rekabentuk',\n",
      "                      'language': 'id',\n",
      "                      'sense_label': 'n, cognition',\n",
      "                      'term': '/c/id/rekabentuk'},\n",
      "            'surfaceText': '[[rekabentuk]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/fa/برنامه_کار/n/wn/artifact/,/c/en/blueprint/n/wn/artifact/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/n/wn/artifact',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'n, artifact',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/fa/برنامه_کار/n/wn/artifact',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'برنامه کار',\n",
      "                      'language': 'fa',\n",
      "                      'sense_label': 'n, artifact',\n",
      "                      'term': '/c/fa/برنامه_کار'},\n",
      "            'surfaceText': '[[برنامه کار]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0},\n",
      "           {'@id': '/a/[/r/Synonym/,/c/fi/luonnostella/v/wn/creation/,/c/en/blueprint/v/wn/creation/]',\n",
      "            '@type': 'Edge',\n",
      "            'dataset': '/d/wordnet/3.1',\n",
      "            'end': {'@id': '/c/en/blueprint/v/wn/creation',\n",
      "                    '@type': 'Node',\n",
      "                    'label': 'blueprint',\n",
      "                    'language': 'en',\n",
      "                    'sense_label': 'v, creation',\n",
      "                    'term': '/c/en/blueprint'},\n",
      "            'license': 'cc:by/4.0',\n",
      "            'rel': {'@id': '/r/Synonym',\n",
      "                    '@type': 'Relation',\n",
      "                    'label': 'Synonym'},\n",
      "            'sources': [{'@id': '/s/resource/wordnet/rdf/3.1',\n",
      "                         '@type': 'Source',\n",
      "                         'contributor': '/s/resource/wordnet/rdf/3.1'}],\n",
      "            'start': {'@id': '/c/fi/luonnostella/v/wn/creation',\n",
      "                      '@type': 'Node',\n",
      "                      'label': 'luonnostella',\n",
      "                      'language': 'fi',\n",
      "                      'sense_label': 'v, creation',\n",
      "                      'term': '/c/fi/luonnostella'},\n",
      "            'surfaceText': '[[luonnostella]] is a translation of [[blueprint]]',\n",
      "            'weight': 2.0}],\n",
      " 'version': '5.8.1',\n",
      " 'view': {'@id': '/c/en/blueprint?offset=0&limit=20',\n",
      "          '@type': 'PartialCollectionView',\n",
      "          'comment': \"There are more results. Follow the 'nextPage' link for \"\n",
      "                     'more.',\n",
      "          'firstPage': '/c/en/blueprint?offset=0&limit=20',\n",
      "          'nextPage': '/c/en/blueprint?offset=20&limit=20',\n",
      "          'paginatedProperty': 'edges'}}\n"
     ]
    }
   ],
   "source": [
    "from pprint import pprint\n",
    "\n",
    "obj = requests.get(\"http://api.conceptnet.io/c/en/blueprint\").json()\n",
    "pprint(obj)"
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2023-05-28T00:38:51.618804500Z",
     "start_time": "2023-05-28T00:38:50.899993800Z"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
